travel_planner/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "g"]]
---
  def create
    username = params["username"]
    password = params["password"]
    u = User.find_by_username(username)