travel_planner/app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    render json: {trips: Trip.all()}