travel_planner/app/controllers/users_controller.rb

  def create
    u = User.create! user_params
---
INSERT INTO "users" ("firstname", "lastname", "username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)